renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/profile_cmn/r_ble_servs_if.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
#include <stdlib.h>
#include <string.h>
#include "r_ble_servs_if.h"

static const st_ble_servs_info_t *gs_servs[BLE_PRF_MAX_NUM_OF_SERVS];
static uint8_t gs_num_of_servs;

static void find_attr(uint16_t attr_hdl,
                      const st_ble_servs_info_t **pp_serv,
                      const st_ble_servs_char_info_t **pp_char)
{
    for (uint8_t s = 0; s < gs_num_of_servs; s++)
    {
        for (uint8_t c = 0; c < gs_servs[s]->num_of_chars; c++)
        {
            if ((gs_servs[s]->pp_chars[c]->start_hdl <= attr_hdl) &&
                (gs_servs[s]->pp_chars[c]->end_hdl >= attr_hdl))
            {
                *pp_serv = gs_servs[s];
                *pp_char = gs_servs[s]->pp_chars[c];
                return;
            }
        }
    }
}

static void desc_write_evt_handler(uint16_t conn_hdl, uint16_t attr_hdl, st_ble_gatt_value_t *p_value)
{
    const st_ble_servs_info_t       *p_serv = NULL;
    const st_ble_servs_char_info_t  *p_char = NULL;

    find_attr(attr_hdl, &p_serv, &p_char);

    if ((NULL != p_serv) && (NULL != p_char))
    {
        if (NULL != p_char->pp_descs)
        {
            for (uint8_t d = 0; d < p_char->num_of_descs; d++)
            {
                if ((p_char->pp_descs[d]->attr_hdl == attr_hdl) &&
                    (NULL != p_char->pp_descs[d]->decode))
                {
                    ble_status_t ret;

                    void *p_app_value;
                    p_app_value = malloc(p_char->pp_descs[d]->app_size);
                    if(NULL == p_app_value)
                    {
                        ret = BLE_ERR_MEM_ALLOC_FAILED;
                    }
                    else
                    {
                        ret = p_char->pp_descs[d]->decode(p_app_value, (const st_ble_gatt_value_t *)p_value);
                    }

                    if (NULL != p_char->pp_descs[d]->write_req_cb)
                    {
                        p_char->pp_descs[d]->write_req_cb(&p_char->pp_descs[d], conn_hdl, ret, (const void *)p_app_value);
                    }
                    else
                    {
                        st_ble_servs_evt_data_t evt_data = {
                            .conn_hdl  = conn_hdl,
                            .param_len = (NULL != p_app_value)?p_char->pp_descs[d]->app_size:0,
                            .p_param   = p_app_value,
                        };
                        if (NULL != p_serv->cb)
                        {
                            p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->pp_descs[d]->desc_idx, p_char->pp_descs[d]->inst_idx, BLE_SERVS_WRITE_REQ), ret, &evt_data);
                        }
                    }
                    if (NULL != p_app_value)
                    {
                        free(p_app_value);
                    }
                    break;
                }
            }
        }
    }
}

static void desc_read_evt_handler(uint16_t conn_hdl, uint16_t attr_hdl)
{
    const st_ble_servs_info_t       *p_serv = NULL;
    const st_ble_servs_char_info_t  *p_char = NULL;

    find_attr(attr_hdl, &p_serv, &p_char);

    if ((NULL != p_serv) && (NULL != p_char))
    {
        if (NULL != p_char->pp_descs)
        {
            for (uint8_t d = 0; d < p_char->num_of_descs; d++)
            {
                if (p_char->pp_descs[d]->attr_hdl == attr_hdl)
                {
                    if (NULL != p_char->pp_descs[d]->read_req_cb)
                    {
                        p_char->pp_descs[d]->read_req_cb(&p_char->pp_descs[d], conn_hdl);
                    }
                    else
                    {
                        st_ble_servs_evt_data_t evt_data = {
                            .conn_hdl   = conn_hdl,
                            .param_len  = 0,
                            .p_param    = NULL,
                        };
                        if (NULL != p_serv->cb)
                        {
                            p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->pp_descs[d]->desc_idx, p_char->pp_descs[d]->inst_idx, BLE_SERVS_READ_REQ), BLE_SUCCESS, &evt_data);
                        }
                    }
                    break;
                }
            }
        }
    }
}

static void ble_gatts_db_app_cb(uint16_t conn_hdl, uint8_t db_op, uint16_t attr_hdl, st_ble_gatt_value_t *p_value)
{
    const st_ble_servs_info_t       *p_serv = NULL;
    const st_ble_servs_char_info_t  *p_char = NULL;


    find_attr(attr_hdl, &p_serv, &p_char);

    if ((NULL == p_serv) || (NULL == p_char))
    {
        return;
    }

    switch (db_op)
    {
        case BLE_GATTS_OP_CHAR_PEER_READ_REQ:
        {
            if (NULL != p_char->read_req_cb)
            {
                p_char->read_req_cb(p_char, conn_hdl);
            }
            else
            {
                st_ble_servs_evt_data_t evt_data = {
                    .conn_hdl  = conn_hdl,
                    .param_len = 0,
                    .p_param   = NULL,
                };
                if (NULL != p_serv->cb)
                {
                    p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->char_idx, p_char->inst_idx, BLE_SERVS_READ_REQ), BLE_SUCCESS, &evt_data);
                }
            }
        } break;

        case BLE_GATTS_OP_CHAR_PEER_WRITE_REQ:
        {
            if (NULL != p_char->decode)
            {
                ble_status_t ret;
                void *p_app_value;

                p_app_value = malloc(p_char->app_size);
                if(NULL == p_app_value)
                {
                    ret = BLE_ERR_MEM_ALLOC_FAILED;
                }
                else
                {
                    ret = p_char->decode(p_app_value, p_value);
                }
                if (NULL != p_char->write_req_cb)
                {
                    p_char->write_req_cb(p_char, conn_hdl, ret, p_app_value);
                }
                else
                {
                    st_ble_servs_evt_data_t evt_data = {
                        .conn_hdl  = conn_hdl,
                        .param_len = (NULL != p_app_value)?p_char->app_size:0,
                        .p_param   = p_app_value,
                    };

